Documents/АР_РаспределениеДолейСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР_РаспределениеДолейСобственников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АР_СобственникиОбъектовАрендыСпр</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСобственник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Собственники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыАренды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расшифровка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АР_РаспределениеДолейСобственников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СобственникиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элементы.Собственники.ТекущиеДанные;
	Если ТекущиеДанные.НомерСтроки <> 1 Тогда
		Если Объект.Собственники.Итог("Доля") > 100 Тогда
			Если Объект.Собственники[0].Доля - ТекущиеДанные.Доля >= 0 Тогда
				Объект.Собственники[0].Доля = Объект.Собственники[0].Доля - ТекущиеДанные.Доля;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Общая сумма не должна превышать 100%";
				Сообщение.Сообщить();
				ТекущиеДанные.Доля = 0;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыАрендыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не ЭтоПомещение(Элемент.ТекущиеДанные.ОбъектАренды) и ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектАренды)  Тогда
		Пом = ПолучитьПомещения(Элемент.ТекущиеДанные.ОбъектАренды);
		Объект.ОбъектыАренды.Удалить(Элемент.ТекущиеДанные.НомерСтроки-1);
		//Объект.ОбъектыАренды.Очистить();//.Удалить(Объект.ОбъектыАренды[Элемент.ТекущиеДанные.НомерСтроки-1]);
		Для Каждого СтрПом из Пом Цикл
			НовоеПом = Объект.ОбъектыАренды.Добавить();
			НовоеПом.ОбъектАренды = СтрПом;
			НовоеПом.Расшифровка = ПолучитьРасшифровку(СтрПом);
			//НовоеПом.Площадь = ПолучитьПлощадьОбщая(СтрПом);
		КонецЦикла;
	КонецЕсли;
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектАренды) Тогда
			Элемент.ТекущиеДанные.Расшифровка = ПолучитьРасшифровку(Элемент.ТекущиеДанные.ОбъектАренды); // + NAI Becar Конюшок С.Н. от 30.01.2017 16:44 вылетает ошибка
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьРасшифровку(ОбъектАренды)
	Расшифровка = СокрЛП(ОбъектАренды.Родитель.Родитель.Родитель) + ", " + СокрЛП(ОбъектАренды.Родитель.Родитель)+ ", " + СокрЛП(ОбъектАренды.Родитель);
	Возврат Расшифровка;
КонецФункции	

Функция ЭтоПомещение(ОбъектАренды)
	 Возврат ОбъектАренды.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Помещение;
КонецФункции	

Функция  ПолучитьПомещения(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Родитель В ИЕРАРХИИ(&Родитель)
	               |	И АР_ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.Помещение)";
	Запрос.УстановитьПараметр("Родитель",Родитель);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	МассивСсылок = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Возврат МассивСсылок;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТЗ = ТекущийОбъект.ОбъектыАренды.Выгрузить();
	ТЗ.Свернуть("ОбъектАренды,Расшифровка");
	ТекущийОбъект.ОбъектыАренды.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.СтрокаСобственник = "";
	Если Объект.Собственники.Количество()=1 Тогда
		Объект.СтрокаСобственник = Объект.Собственники[0].Контрагент;
	Иначе
		Объект.СтрокаСобственник = "Общедолевая собственность";
	КонецЕсли;
	
КонецПроцедуры
